wosayttn/M55M1BSP/_CUnit/rtc/rtc_cunit.c
/*---------------------------------------------------------------------------------------------------------*/
/* Winbond Electronics Corporation confidential                                                            */
/*                                                                                                         */
/* Copyright (c) 2016 by Nuvoton Technology Corporation                                                    */
/* All rights reserved                                                                                     */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
/* File Contents:                                                                                          */
/*   rtc_cunit.c                                                                                           */
/*            The test function of RTC for CUnit.                                                          */
/* Project:   M2354                                                                                     */
/*---------------------------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of system headers                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "rtc_cunit.h"

//#define D_msg   printf
#define D_msg(...)
//#define _PZ1_EMU_


extern unsigned int STATE0; 
extern unsigned int STATE1;
extern unsigned int ERR_STATE0;
extern unsigned int ERR_STATE1;
/*---------------------------------------------------------------------------------------------------------*/
/* Test function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/

int suite_success_init(void) { return 0; }
int suite_success_clean(void) { return 0; }

/*---------------------------------------------------------------------------------------------------------*/
/* Function: function_name                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               param - [in/out], parameter_description                                                   */
/*               param - [in/out], parameter_description                                                   */
/*                                                                                                         */
/* Returns:      the_value                                                                                 */
/* Side effects: the_effect                                                                                */
/* Description:                                                                                            */
/*               description                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

CU_SuiteInfo suites[] =
{
    {"RTC CONSTANT & MACRO", suite_success_init, suite_success_clean, NULL, NULL, RTC_CONSTANT_MACRO},
    {"RTC API", suite_success_init, suite_success_clean, NULL, NULL, RTC_API},
    CU_SUITE_INFO_NULL
};

void RTC_WaitAccessEnable(void)
{
    // NULL function. NOT support in M2354
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)  /* Pre-defined in TrustZone-Secure */
__attribute__((cmse_nonsecure_entry))
#endif
#if !defined (TRUSTZONE_NON_SECURE)                             /* Pre-defined in TrustZone-NonSecure */
void Timer0_Init(uint32_t u32ClkSrc)
{
    if(u32ClkSrc == CLK_TMRSEL_TMR0SEL_LIRC) {
        //CLK->CLKSEL1 = (CLK->CLKSEL1&~CLK_CLKSEL1_TMR0SEL_Msk) | u32ClkSrc;
        CLK_SetModuleClock(TMR0_MODULE, CLK_TMRSEL_TMR0SEL_LIRC, 0);
    } else {
        //CLK->CLKSEL1 = (CLK->CLKSEL1&~CLK_CLKSEL1_TMR0SEL_Msk) | CLK_CLKSEL1_TMR0SEL_HXT;
        CLK_SetModuleClock(TMR0_MODULE, CLK_TMRSEL_TMR0SEL_HIRC, 0);
    }
    /* Enable Clock Timer 0 module plck */
    CLK_EnableModuleClock(TMR0_MODULE);
    
    TIMER0->CNT = 0;
    TIMER0->CMP = 0xFFFFFF;
    if(u32ClkSrc == CLK_TMRSEL_TMR0SEL_LIRC) {
        /* Enable LIRC */
        CLK_EnableXtalRC(CLK_SRCCTL_LIRCEN_Msk);

        /* Waiting for clock ready */
        CLK_WaitClockReady(CLK_STATUS_LIRCSTB_Msk);
        TIMER0->CTL = TIMER_PERIODIC_MODE | TIMER_CTL_CNTEN_Msk;
    } else {
        TIMER0->CTL = TIMER_PERIODIC_MODE | TIMER_CTL_CNTEN_Msk | (12-1);
    }   
}
#else
extern void Timer0_Init(uint32_t u32ClkSrc);
#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)  /* Pre-defined in TrustZone-Secure */
__attribute__((cmse_nonsecure_entry))
#endif
#if !defined (TRUSTZONE_NON_SECURE)                             /* Pre-defined in TrustZone-NonSecure */
void Timer0_ResetrCounter(void)
{
    TIMER0->CNT = 0UL;
}
#else
extern void Timer0_ResetrCounter(void);
#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)  /* Pre-defined in TrustZone-Secure */
__attribute__((cmse_nonsecure_entry))
#endif
#if !defined (TRUSTZONE_NON_SECURE)                             /* Pre-defined in TrustZone-NonSecure */
uint32_t Timer0_GetCounter(void)
{
    return TIMER0->CNT;
}
#else
extern uint32_t Timer0_GetCounter(void);
#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)  /* Pre-defined in TrustZone-Secure */
__attribute__((cmse_nonsecure_entry))
#endif
#if !defined (TRUSTZONE_NON_SECURE)                             /* Pre-defined in TrustZone-NonSecure */
void NSC_NVIC_EnableIRQ(IRQn_Type IRQn)
{
    NVIC_EnableIRQ(IRQn);
}
#else
extern void NSC_NVIC_EnableIRQ(IRQn_Type IRQn);
#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)  /* Pre-defined in TrustZone-Secure */
__attribute__((cmse_nonsecure_entry))
#endif
#if !defined (TRUSTZONE_NON_SECURE)                             /* Pre-defined in TrustZone-NonSecure */
void NSC_NVIC_DisableIRQ(IRQn_Type IRQn)
{
    NVIC_DisableIRQ(IRQn);
}
#else
extern void NSC_NVIC_DisableIRQ(IRQn_Type IRQn);
#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)  /* Pre-defined in TrustZone-Secure */
__attribute__((cmse_nonsecure_entry))
#endif
#if !defined (TRUSTZONE_NON_SECURE)                             /* Pre-defined in TrustZone-NonSecure */
int32_t RTC_InitClock(void)
{    
    volatile uint32_t u32Timeout = SystemCoreClock/10;
    
    Timer0_Init(CLK_TMRSEL_TMR0SEL_HIRC);
    
    /* Enable LXT */
    CLK_EnableXtalRC(CLK_SRCCTL_LXTEN_Msk);
    
