wosayttn/M55M1BSP/_CUnit/rtc/rtc_cunit.c
    CLK_WaitClockReady(CLK_STATUS_LXTSTB_Msk);

    /* Waiting for clock ready */
    CLK_EnableModuleClock(RTC0_MODULE); 

    return 0;
}
#else
extern int32_t RTC_InitClock(void);
#endif

volatile uint32_t gu32TickINT = 0;
void RTC_IRQHandler(void)
{
    RTC_T *pRTC;
    
//    if((__PC()&NS_OFFSET) == NS_OFFSET)
//        pRTC = RTC_NS;
//    else
        pRTC = RTC;

    /* To check if RTC TICK interrupt occurred */
    if(RTC_GET_TICK_INT_FLAG(pRTC) == 1) {
        /* Clear RTC TICK interrupt flag */
        RTC_CLEAR_TICK_INT_FLAG(pRTC);
        gu32TickINT = 1;
    }
}

void RTCTAMPER_IRQHandler(void)
{
    RTC_T *pRTC;
    
//    if((__PC()&NS_OFFSET) == NS_OFFSET)
//        pRTC = RTC_NS;
//    else
        pRTC = RTC;
    
    /* To check if RTC snooper pin interrupt occurred */
    if(RTC_GET_TAMPER_INT_STATUS(pRTC) == 1) {
        /* Clear RTC snooper pin interrupt flag */
        RTC_CLEAR_TAMPER_INT_FLAG(pRTC, RTC_GET_TAMPER_INT_FLAG(pRTC));
    }
}

const uint32_t au32TICKSel[] = {
    RTC_TICK_1_SEC,
    RTC_TICK_1_2_SEC,
    RTC_TICK_1_4_SEC,
    RTC_TICK_1_8_SEC,
    RTC_TICK_1_16_SEC,
    RTC_TICK_1_32_SEC,
    RTC_TICK_1_64_SEC,
    RTC_TICK_1_128_SEC,
};

const uint32_t au32WEEKDAYSel[] = {
    RTC_SUNDAY,
    RTC_MONDAY,
    RTC_TUESDAY,
    RTC_WEDNESDAY,
    RTC_THURSDAY,
    RTC_FRIDAY,
    RTC_SATURDAY,
};

const uint32_t au32SeedChangeRate[] = {
    RTC_2POW10_CLK,
    RTC_2POW11_CLK,
	RTC_2POW12_CLK,
	RTC_2POW13_CLK,
	RTC_2POW14_CLK,
	RTC_2POW15_CLK,
	RTC_2POW16_CLK,
	RTC_2POW17_CLK,
};

const uint32_t u32RefPattern[] = {
    RTC_REF_RANDOM_PATTERN,
	RTC_REF_SEED_VALUE,
};

const uint32_t au32SPRDataPattern[] = {
    0x55555555, 0xAAAAAAAA,
    0xFFFFFFFF, 0x00000000,
};

void CONSTANT_RTC(void)
{
    volatile uint32_t i = 0;
    volatile uint32_t u32Timeout;
    RTC_T *pRTC;
    
//    if((__PC()&NS_OFFSET) == NS_OFFSET)
//        pRTC = RTC_NS;
//    else
        pRTC = RTC;
    
    /* Init RTC clock */
    CU_ASSERT_EQUAL(RTC_InitClock(), 0);     

    CU_ASSERT_EQUAL(RTC_YEAR2000, 2000);     
    CU_ASSERT_EQUAL(RTC_FCR_REFERENCE, 32752);     

    /* Check RTC_INIT_KEY and RTC_WRITE_KEY Constant */
        u32Timeout = SystemCoreClock/10;
        pRTC->INIT = RTC_INIT_KEY;
        while(pRTC->INIT != RTC_INIT_ACTIVE_Msk) {
            if(u32Timeout-- == 0) {
                CU_FAIL("INIT FAIL");  
                return ;
            }
        }      
//        u32Timeout = SystemCoreClock/1000;
//        while((pRTC->RWEN & RTC_RWEN_RWENF_Msk) != RTC_RWEN_RWENF_Msk) {
//            if(u32Timeout-- == 0) { 
//                CU_FAIL("Default RWENF FAIL");  
//                break;
//            }    
//        }            
//        u32Timeout = SystemCoreClock/1000;
//        pRTC->RWEN = RTC_WRITE_KEY;
//        while((pRTC->RWEN & RTC_RWEN_RWENF_Msk) == 0x0) {
//            if(u32Timeout-- == 0) {
//                CU_FAIL("Enable RWENF FAIL");  
//                break;
//            }    
//        }    

    /* Check RTC Tick Period Constant; RTC_SetTickPeriod()*/
        for(i=0; i<(sizeof(au32TICKSel)/sizeof(au32TICKSel[0])); i++) {
            D_msg("TICK Sel %d\n", i);
            RTC_SetTickPeriod(au32TICKSel[i]);
            RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL(pRTC->TICK, (i <<RTC_TICK_TICK_Pos));     
        }

    /* Check WEEKDAY Constant */
        for(i=0; i<(sizeof(au32WEEKDAYSel)/sizeof(au32WEEKDAYSel[0])); i++) {
            D_msg("WEEKDAY Sel %d\n", i);
            RTC_WaitAccessEnable();
            pRTC->WEEKDAY = au32WEEKDAYSel[i] << RTC_WEEKDAY_WEEKDAY_Pos;
            RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL(pRTC->WEEKDAY, (i <<RTC_WEEKDAY_WEEKDAY_Pos));     
        }

    /* Check Snooper Detection Mode Constant;RTC_EnableSnooperDetection() */
        CU_ASSERT_EQUAL(MAX_TAMPER_PIN_NUM, 6);     
        {
			uint32_t u32TamperSel = (RTC_TAMPER0_SELECT|RTC_TAMPER1_SELECT|RTC_TAMPER2_SELECT|
			                         RTC_TAMPER3_SELECT|RTC_TAMPER4_SELECT|RTC_TAMPER5_SELECT);
			uint32_t u32DetLevel = RTC_TAMPER_HIGH_LEVEL_DETECT;
			uint32_t u32Debounce = RTC_TAMPER_DEBOUNCE_ENABLE;
			
			RTC_StaticTamperDisable(u32TamperSel);
			
			RTC_StaticTamperEnable(u32TamperSel, u32DetLevel, u32Debounce);
				
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0EN_Msk), (0x1 << 8));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1EN_Msk), (0x1 << 12)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2EN_Msk), (0x1 << 16)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3EN_Msk), (0x1 << 20)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4EN_Msk), (0x1 << 24)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5EN_Msk), (0x1 << 28)); 
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0LV_Msk), (0x1 << 9));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1LV_Msk), (0x1 << 13)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2LV_Msk), (0x1 << 17)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3LV_Msk), (0x1 << 21)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4LV_Msk), (0x1 << 25)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5LV_Msk), (0x1 << 29));

			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0DEN_Msk), (0x1 << 10));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1DEN_Msk), (0x1 << 14)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2DEN_Msk), (0x1 << 18)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3DEN_Msk), (0x1 << 22)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4DEN_Msk), (0x1 << 26)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5DEN_Msk), (0x1 << 30));

