wosayttn/M55M1BSP/_CUnit/rtc/rtc_cunit.c
            RTC_StaticTamperDisable(u32TamperSel);
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0EN_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5EN_Msk), 0); 

            u32DetLevel = RTC_TAMPER_LOW_LEVEL_DETECT;
			u32Debounce = RTC_TAMPER_DEBOUNCE_DISABLE;
			
			RTC_StaticTamperEnable(u32TamperSel, u32DetLevel, u32Debounce);
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0LV_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1LV_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2LV_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3LV_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4LV_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5LV_Msk), 0);

			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0DEN_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1DEN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2DEN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3DEN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4DEN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5DEN_Msk), 0);
            
            RTC_StaticTamperDisable(u32TamperSel);
            /* To check if RTC snooper pin interrupt occurred */
            if(RTC_GET_TAMPER_INT_FLAG(pRTC)) {
                D_msg("\n        * Get TAMPER FLAGs: 0x%x", RTC_GET_TAMPER_INT_STATUS(pRTC)); 
                /* Clear RTC snooper pin interrupt flag */
                
                RTC_CLEAR_TAMPER_INT_FLAG(pRTC, RTC_GET_TAMPER_INT_STATUS(pRTC));
                CU_ASSERT_EQUAL(RTC_GET_TAMPER_INT_STATUS(pRTC), 0);
            }
            D_msg("\n        * Get TAMPER FLAGs: 0x%x", RTC_GET_TAMPER_INT_STATUS(pRTC));
            RTC_StaticTamperDisable(u32TamperSel);
        }
                    
        CU_ASSERT_EQUAL(MAX_PAIR_NUM, 3);             
        {
            uint32_t u32PairSel = (RTC_PAIR0_SELECT|RTC_PAIR1_SELECT|RTC_PAIR2_SELECT);
			uint32_t u32Pair1Source = 0;
			uint32_t u32Pair2Source = 0;
			uint32_t u32Debounce_ = RTC_TAMPER_DEBOUNCE_ENABLE;
			
			RTC_DynamicTamperEnable(u32PairSel, u32Debounce_, u32Pair1Source, u32Pair2Source);

			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0EN_Msk), (0x1 << 8));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1EN_Msk), (0x1 << 12)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2EN_Msk), (0x1 << 16)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3EN_Msk), (0x1 << 20)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4EN_Msk), (0x1 << 24)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5EN_Msk), (0x1 << 28)); 
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0DEN_Msk), (0x1 << 10));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1DEN_Msk), (0x1 << 14)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2DEN_Msk), (0x1 << 18)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3DEN_Msk), (0x1 << 22)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4DEN_Msk), (0x1 << 26)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5DEN_Msk), (0x1 << 30));
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR0EN_Msk), (0x1 << 15));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR1EN_Msk), (0x1 << 23));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR2EN_Msk), (0x1ul << 31));
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYN1ISS_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYN2ISS_Msk), 0);
			
            RTC_DynamicTamperDisable(u32PairSel);
            /* To check if RTC snooper pin interrupt occurred */
            if(RTC_GET_TAMPER_INT_FLAG(pRTC)) {
                D_msg("\n        * Get TAMPER FLAGs: 0x%x", RTC_GET_TAMPER_INT_STATUS(pRTC)); 
                /* Clear RTC snooper pin interrupt flag */
                
                RTC_CLEAR_TAMPER_INT_FLAG(pRTC, RTC_GET_TAMPER_INT_STATUS(pRTC));
                CU_ASSERT_EQUAL(RTC_GET_TAMPER_INT_STATUS(pRTC), 0);
            }
            D_msg("\n        * Get TAMPER FLAGs: 0x%x", RTC_GET_TAMPER_INT_STATUS(pRTC));
			RTC_DynamicTamperDisable(u32PairSel);
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0EN_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5EN_Msk), 0); 
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR0EN_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR1EN_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR2EN_Msk), 0);
			
			u32Pair1Source = 1;
			u32Pair2Source = 1;
			u32Debounce_ = RTC_TAMPER_DEBOUNCE_DISABLE;
			
			RTC_DynamicTamperEnable(u32PairSel, u32Debounce_, u32Pair1Source, u32Pair2Source);
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0EN_Msk), (0x1 << 8));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1EN_Msk), (0x1 << 12)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3EN_Msk), (0x1 << 20)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4EN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5EN_Msk), (0x1 << 28)); 
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP0DEN_Msk), 0);
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP1DEN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP2DEN_Msk), (0x1 << 18)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP3DEN_Msk), 0); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP4DEN_Msk), (0x1 << 26)); 
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_TAMP5DEN_Msk), 0);
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR0EN_Msk), (0x1 << 15));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR1EN_Msk), (0x1 << 23));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNPR2EN_Msk), (0x1ul << 31));
			
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYN1ISS_Msk), (0x1 << 0));
			RTC_WaitAccessEnable();
            CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYN2ISS_Msk), (0x1 << 1));	
		}	

        {
			for(i = 0; i < 8; i++)
			{
				RTC_DynamicTamperConfig(au32SeedChangeRate[i], 0, 0, 0);
				
				RTC_WaitAccessEnable();
				CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNRATE_Msk), (i << 5));
			}
			
