wosayttn/M55M1BSP/_CUnit/rtc/rtc_cunit.c
            #if 0 /* seed reload bit will auto-clear, can not check this bit */
			for(i = 0; i < 2; i++)
			{
				RTC_DynamicTamperConfig(au32SeedChangeRate[0], i, 0, 0);
				
				RTC_WaitAccessEnable();
				CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_SEEDRLD_Msk), (0x0 << 4));
			}
			#endif
            
			for(i = 0; i < 2; i++)
			{
				RTC_DynamicTamperConfig(au32SeedChangeRate[0], 0, u32RefPattern[i], 0);
				
				RTC_WaitAccessEnable();
                
                if(u32RefPattern[i] == RTC_REF_SEED_VALUE)
                {
                    CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNSRC_Msk), (0x1 << 3));
                }
                
                if(u32RefPattern[i] == RTC_REF_RANDOM_PATTERN)
                {
                    CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNSRC_Msk), (0x0 << 3));
                }
                
//                if(u32RefPattern[i] == REF_PREVIOUS_PATTERN)
//                {
//                    CU_ASSERT_EQUAL((pRTC->TAMPCTL & RTC_TAMPCTL_DYNSRC_Msk), (0x1 << 2));
//                }
			}
			
			for(i = 0; i < 5; i++)
			{
				RTC_DynamicTamperConfig(au32SeedChangeRate[0], 0, 0, (i*5));
				
				RTC_WaitAccessEnable();
				CU_ASSERT_EQUAL((pRTC->TAMPSEED & RTC_TAMPSEED_SEED_Msk), (i*5));
			}
        }	
        
        RTC_EnableSpareAccess();
        pRTC->TAMPCTL = 0;
        pRTC->INTSTS = 0x3f00;
}

void MACRO_RTC(void)
{
    volatile uint32_t i = 0, j = 0;
    volatile uint32_t u32Value, u32Timeout;
    S_RTC_TIME_DATA_T sWriteRTC, sReadRTC;
    RTC_T *pRTC;
    
//    if((__PC()&NS_OFFSET) == NS_OFFSET)
//        pRTC = RTC_NS;
//    else
        pRTC = RTC;
    
    /* Init RTC clock */
    CU_ASSERT_EQUAL(RTC_InitClock(), 0);     

    u32Timeout = SystemCoreClock/1000;
    pRTC->INIT = RTC_INIT_KEY;
    while(pRTC->INIT != RTC_INIT_ACTIVE_Msk) {
        if(u32Timeout-- == 0) {
            CU_FAIL("INIT FAIL");  
            return ;
        }
    }    
        
    /* Check RTC_IS_LEAP_YEAR Macro; RTC_SetDate() */
        RTC_SetDate(2016, 1, 24, RTC_SUNDAY);
        RTC_WaitAccessEnable();
        CU_ASSERT_EQUAL(pRTC->LEAPYEAR, 1);     
        RTC_SetDate(2015, 1, 24, RTC_SATURDAY);
        RTC_WaitAccessEnable();
        CU_ASSERT_EQUAL(pRTC->LEAPYEAR, 0);

    /* Check RTC_GET_TICK_INT_FLAG and RTC_CLEAR_TICK_INT_FLAG Macro; RTC_SetTickPeriod()*/        
        u32Timeout = SystemCoreClock/100;
        RTC_SetTickPeriod(RTC_TICK_1_128_SEC);
        while(1) {
            if(RTC_GET_TICK_INT_FLAG(pRTC) == 1) {
                RTC_CLEAR_TICK_INT_FLAG(pRTC);
                break;
            }                
            if(u32Timeout-- == 0) {
                CU_FAIL("RTC_GET_TICK_INT_FLAG FAIL");
                return ;
            }                
        }
        while(RTC_GET_TICK_INT_FLAG(pRTC) == 0);
        RTC_CLEAR_TICK_INT_FLAG(pRTC);
        Timer0_ResetrCounter();        
        CU_ASSERT_EQUAL(RTC_GET_TICK_INT_FLAG(pRTC), 0); 

        u32Timeout = SystemCoreClock/100;
        while(1) {
            if(RTC_GET_TICK_INT_FLAG(pRTC) == 1) {
                RTC_CLEAR_TICK_INT_FLAG(pRTC);
                break;
            }                
            if(u32Timeout-- == 0) {
                CU_FAIL("RTC_GET_TICK_INT_FLAG FAIL");
                return ;
            }                    
        }
        u32Value = Timer0_GetCounter();
        D_msg("CNT: %d\n", u32Value);
#ifdef _PZ1_EMU_ // in pz1 LXT is 3.276Mhz   
        if((u32Value > (78+5)) || (u32Value < (78-5))) {
            CU_FAIL("TICK Period FAIL");
            return ;
        }  
#else //for real chip  32.768Khz  
        if((u32Value > (7812+50)) || (u32Value < (7812-50))) {
            CU_FAIL("TICK Period FAIL");
            return ;
        }      
#endif        
        RTC_WaitAccessEnable();
        pRTC->TICK = RTC_TICK_1_SEC << RTC_TICK_TICK_Pos;  
       
        RTC_WaitAccessEnable();
        //from RTC set time to start conmt, need 2*(1/128) second.
        pRTC->CAL  = 0x00140301;
        pRTC->TIME = 0x00020101;
    /* Check RTC_GET_ALARM_INT_FLAG and RTC_CLEAR_ALARM_INT_FLAG Macro; RTC_SetAlarmDateAndTime(), RTC_GetAlarmDateAndTime() */
        u32Timeout = SystemCoreClock/2;
        RTC_CLEAR_ALARM_INT_FLAG(pRTC);
        RTC_WaitAccessEnable();
        pRTC->CALM = 0x00140301;
        RTC_WaitAccessEnable();
        pRTC->TALM = 0x00020102;
        while(RTC_GET_ALARM_INT_FLAG(pRTC) == 0);
        RTC_CLEAR_ALARM_INT_FLAG(pRTC);
        Timer0_ResetrCounter();
        
        sWriteRTC.u32Year       = 2014;
        sWriteRTC.u32Month      = 3;
        sWriteRTC.u32Day        = 1;
        sWriteRTC.u32Hour       = 2;
        sWriteRTC.u32Minute     = 1;
        sWriteRTC.u32Second     = 3;
        sWriteRTC.u32TimeScale  = RTC_CLOCK_24;
        RTC_SetAlarmDateAndTime(&sWriteRTC);                

        while(1) {
            if(RTC_GET_ALARM_INT_FLAG(pRTC) == 1) {
                RTC_CLEAR_ALARM_INT_FLAG(pRTC);
                break;
            }                
            if(u32Timeout-- == 0) {
                CU_FAIL("RTC_GET_ALARM_INT_FLAG FAIL");
                return ;
            }                
                
        }
        u32Value = Timer0_GetCounter();
        CU_ASSERT_EQUAL(RTC_GET_ALARM_INT_FLAG(pRTC), 0); 
        D_msg("CNT: %d\n", u32Value);
#ifdef _PZ1_EMU_ // in pz1 LXT is 3.276Mhz
        if((u32Value > (10000+20)) || (u32Value < (10000-20))) {
            CU_FAIL("ALARM Period FAIL");
            return ;
        }        
#else        
        if((u32Value > (1000000+200)) || (u32Value < (1000000-200))) {
            CU_FAIL("ALARM Period FAIL");
            return ;
        }
#endif  
        //printf("Check Data\r\n");
        RTC_WaitAccessEnable();
        CU_ASSERT_EQUAL(pRTC->CALM, 0x00140301);
        CU_ASSERT_EQUAL(pRTC->TALM, 0x00020103);
        RTC_GetAlarmDateAndTime(&sReadRTC);
        CU_ASSERT_EQUAL(sReadRTC.u32Year,   2014);
        CU_ASSERT_EQUAL(sReadRTC.u32Month,  3);
        CU_ASSERT_EQUAL(sReadRTC.u32Day,    1);
        CU_ASSERT_EQUAL(sReadRTC.u32Hour,   2);
        CU_ASSERT_EQUAL(sReadRTC.u32Minute, 1);
        CU_ASSERT_EQUAL(sReadRTC.u32Second, 3);
        CU_ASSERT_EQUAL(sReadRTC.u32TimeScale, RTC_CLOCK_24);
        D_msg("%d/%02d/%02d %02d:%02d:%02d\n",
                sReadRTC.u32Year, sReadRTC.u32Month, sReadRTC.u32Day, sReadRTC.u32Hour, sReadRTC.u32Minute, sReadRTC.u32Second);              

