wosayttn/M55M1BSP/_CUnit/rtc/rtc_cunit.c
    /* Check RTC_ENABLE_TICK_WAKEUP, RTC_DISABLE_TICK_WAKEUP */   
        RTC_ENABLE_TICK_WAKEUP(pRTC);
        CU_ASSERT_EQUAL((pRTC->INTEN&BIT1), BIT1);
        RTC_DISABLE_TICK_WAKEUP(pRTC);
        CU_ASSERT_EQUAL((pRTC->INTEN&BIT1), 0x0);
 
    /* Check RTC_WRITE_SPARE_REGISTER and RTC_READ_SPARE_REGISTER Macro; RTC_EnableSpareAccess(), RTC_DisableSpareRegister() */
        RTC_EnableSpareAccess();
        CU_ASSERT_EQUAL(pRTC->SPRCTL, (pRTC->SPRCTL|RTC_SPRCTL_SPRRWEN_Msk));    
        RTC_EnableSpareAccess();
        pRTC->TAMPCTL = 0;
        pRTC->SPRCTL = pRTC->SPRCTL;
        D_msg("\n RTC->SPRCTL = 0x%x ", pRTC->SPRCTL );
        D_msg("\n RTC->TAMPCTL = 0x%x ", pRTC->TAMPCTL );
       
        for(i=0; i<(sizeof(au32SPRDataPattern)/sizeof(au32SPRDataPattern[0])); i++) { 
            for(j=0; j<20; j++) {
                RTC_WaitAccessEnable();
                RTC_WRITE_SPARE_REGISTER(pRTC, j, au32SPRDataPattern[i]);
                RTC_WaitAccessEnable();
                CU_ASSERT_EQUAL(RTC_READ_SPARE_REGISTER(pRTC, j), au32SPRDataPattern[i]);
                D_msg("SPARE[%d]:0x%x\r\n",j,RTC_READ_SPARE_REGISTER(pRTC, j));
            }
        }
        RTC_WaitAccessEnable();
        RTC_WRITE_SPARE_REGISTER(pRTC, 0, 0x5A5AA5A5);
        RTC_WaitAccessEnable();
        CU_ASSERT_EQUAL(RTC_READ_SPARE_REGISTER(pRTC, 0), 0x5A5AA5A5);     
        RTC_DisableSpareRegister();
        RTC_WaitAccessEnable();
        RTC_WRITE_SPARE_REGISTER(pRTC, 0, 0x5555AAAA);      
        RTC_EnableSpareAccess();
        RTC_WaitAccessEnable();
        CU_ASSERT_EQUAL(RTC_READ_SPARE_REGISTER(pRTC, 0), 0x5A5AA5A5);    
        RTC_DisableSpareRegister();        
}

void API_RTC_DataTime_Func(void) 
{
    volatile uint32_t i = 0, j = 0;
    volatile uint32_t u32Value, u32Timeout;
    S_RTC_TIME_DATA_T sWriteRTC, sReadRTC;
    RTC_T *pRTC;
    
//    if((__PC()&NS_OFFSET) == NS_OFFSET)
//        pRTC = RTC_NS;
//    else
        pRTC = RTC;
    
    /* Init RTC clock */
    CU_ASSERT_EQUAL(RTC_InitClock(), 0);     

    u32Timeout = SystemCoreClock/1000;
    pRTC->INIT = RTC_INIT_KEY;
    while(pRTC->INIT != RTC_INIT_ACTIVE_Msk) {
        if(u32Timeout-- == 0) {
            CU_FAIL("INIT FAIL");  
            return ;
        }
    }   

    /* Date/Time 1: 24-Hour */
    /* Check RTC_Open(); Open RTC and start counting */
        sWriteRTC.u32Year       = 2014;
        sWriteRTC.u32Month      = 5;
        sWriteRTC.u32Day        = 15;
        sWriteRTC.u32DayOfWeek  = RTC_THURSDAY;
        sWriteRTC.u32Hour       = 13;
        sWriteRTC.u32Minute     = 14;
        sWriteRTC.u32Second     = 5;
        sWriteRTC.u32TimeScale  = RTC_CLOCK_24;
        RTC_Open(&sWriteRTC);
        RTC_WaitAccessEnable();    
        /* Check RTC_GetDateAndTime(); Read current RTC date/time */
        RTC_GetDateAndTime(&sReadRTC);
        CU_ASSERT_EQUAL(sReadRTC.u32Year,   2014);
        CU_ASSERT_EQUAL(sReadRTC.u32Month,  5);
        CU_ASSERT_EQUAL(sReadRTC.u32Day,    15);
        CU_ASSERT_EQUAL(sReadRTC.u32Hour,   13);
        CU_ASSERT_EQUAL(sReadRTC.u32Minute, 14);
        CU_ASSERT_EQUAL(sReadRTC.u32Second, 5);
        CU_ASSERT_EQUAL(sReadRTC.u32DayOfWeek, RTC_THURSDAY);
        CU_ASSERT_EQUAL(sReadRTC.u32TimeScale, RTC_CLOCK_24);  
        /* Check RTC_GetDayOfWeek(), RTC_IS_LEAP_YEAR() */
        CU_ASSERT_EQUAL(RTC_GetDayOfWeek(), RTC_THURSDAY);
        CU_ASSERT_EQUAL(RTC_IS_LEAP_YEAR(pRTC), 0);
        D_msg("%d/%02d/%02d %02d:%02d:%02d\n",
                sReadRTC.u32Year, sReadRTC.u32Month, sReadRTC.u32Day, sReadRTC.u32Hour, sReadRTC.u32Minute, sReadRTC.u32Second);
        
    /* Date/Time 2: 12-Hour, PM */
    /* Check RTC_Open(); Open RTC and start counting */
        sWriteRTC.u32Year       = 2016;
        sWriteRTC.u32Month      = 1;
        sWriteRTC.u32Day        = 24;
        sWriteRTC.u32DayOfWeek  = RTC_SUNDAY;
        sWriteRTC.u32Hour       = 14;
        sWriteRTC.u32Minute     = 24;
        sWriteRTC.u32Second     = 0;
        sWriteRTC.u32TimeScale  = RTC_CLOCK_12;
        sWriteRTC.u32AmPm       = RTC_PM;
        RTC_Open(&sWriteRTC);
        RTC_WaitAccessEnable();    
        /* Check RTC_GetDateAndTime(); Read current RTC date/time */
        RTC_GetDateAndTime(&sReadRTC);
        CU_ASSERT_EQUAL(sReadRTC.u32Year,   2016);
        CU_ASSERT_EQUAL(sReadRTC.u32Month,  1);
        CU_ASSERT_EQUAL(sReadRTC.u32Day,    24);
        CU_ASSERT_EQUAL(sReadRTC.u32Hour,   14);
        CU_ASSERT_EQUAL(sReadRTC.u32Minute, 24);
        CU_ASSERT_EQUAL(sReadRTC.u32Second, 0);
        CU_ASSERT_EQUAL(sReadRTC.u32DayOfWeek, RTC_SUNDAY);
        CU_ASSERT_EQUAL(sReadRTC.u32TimeScale, RTC_CLOCK_12);    
        /* Check RTC_GetDayOfWeek(), RTC_IS_LEAP_YEAR() */
        CU_ASSERT_EQUAL(RTC_GetDayOfWeek(), RTC_SUNDAY);
        CU_ASSERT_EQUAL(RTC_IS_LEAP_YEAR(pRTC), 1);
        CU_ASSERT_EQUAL((pRTC->TIME&BIT21), BIT21);        
        D_msg("%d/%02d/%02d %02d:%02d:%02d\n",
                sReadRTC.u32Year, sReadRTC.u32Month, sReadRTC.u32Day, sReadRTC.u32Hour, sReadRTC.u32Minute, sReadRTC.u32Second);              

    /* Date/Time 3: 12-Hour, AM */
    /* Check RTC_Open(); Open RTC and start counting */
        sWriteRTC.u32Year       = 2016;
        sWriteRTC.u32Month      = 2;
        sWriteRTC.u32Day        = 28;
        sWriteRTC.u32DayOfWeek  = RTC_SUNDAY;
        sWriteRTC.u32Hour       = 3;
        sWriteRTC.u32Minute     = 30;
        sWriteRTC.u32Second     = 10;
        sWriteRTC.u32TimeScale  = RTC_CLOCK_12;
        sWriteRTC.u32AmPm       = RTC_AM;
        RTC_Open(&sWriteRTC);
        RTC_WaitAccessEnable();    
        /* Check RTC_GetDateAndTime(); Read current RTC date/time */
        RTC_GetDateAndTime(&sReadRTC);
        CU_ASSERT_EQUAL(sReadRTC.u32Year,   2016);
        CU_ASSERT_EQUAL(sReadRTC.u32Month,  2);
        CU_ASSERT_EQUAL(sReadRTC.u32Day,    28);
        CU_ASSERT_EQUAL(sReadRTC.u32Hour,   3);
        CU_ASSERT_EQUAL(sReadRTC.u32Minute, 30);
        CU_ASSERT_EQUAL(sReadRTC.u32Second, 10);
        CU_ASSERT_EQUAL(sReadRTC.u32DayOfWeek, RTC_SUNDAY);
        CU_ASSERT_EQUAL(sReadRTC.u32TimeScale, RTC_CLOCK_12);    
        /* Check RTC_GetDayOfWeek(), RTC_IS_LEAP_YEAR() */
        CU_ASSERT_EQUAL(RTC_GetDayOfWeek(), RTC_SUNDAY);
        CU_ASSERT_EQUAL(RTC_IS_LEAP_YEAR(pRTC), 1);
        CU_ASSERT_EQUAL((pRTC->TIME&BIT21), 0);        
        D_msg("%d/%02d/%02d %02d:%02d:%02d\n",
                sReadRTC.u32Year, sReadRTC.u32Month, sReadRTC.u32Day, sReadRTC.u32Hour, sReadRTC.u32Minute, sReadRTC.u32Second);              

    /* Date/Time 1: 24-Hour */
    /* Check RTC_SetDateAndTime(); Configure RTC and start counting */
        sWriteRTC.u32Year       = 2014;
        sWriteRTC.u32Month      = 5;
        sWriteRTC.u32Day        = 15;
        sWriteRTC.u32DayOfWeek  = RTC_THURSDAY;
        sWriteRTC.u32Hour       = 13;
        sWriteRTC.u32Minute     = 14;
        sWriteRTC.u32Second     = 5;
        sWriteRTC.u32TimeScale  = RTC_CLOCK_24;
        RTC_SetDateAndTime(&sWriteRTC);
        RTC_WaitAccessEnable();    
        /* Check RTC_GetDateAndTime(); Read current RTC date/time */
        RTC_GetDateAndTime(&sReadRTC);
        CU_ASSERT_EQUAL(sReadRTC.u32Year,   2014);
        CU_ASSERT_EQUAL(sReadRTC.u32Month,  5);
        CU_ASSERT_EQUAL(sReadRTC.u32Day,    15);
        CU_ASSERT_EQUAL(sReadRTC.u32Hour,   13);
        CU_ASSERT_EQUAL(sReadRTC.u32Minute, 14);
        CU_ASSERT_EQUAL(sReadRTC.u32Second, 5);
        CU_ASSERT_EQUAL(sReadRTC.u32DayOfWeek, RTC_THURSDAY);
        CU_ASSERT_EQUAL(sReadRTC.u32TimeScale, RTC_CLOCK_24);  
        /* Check RTC_GetDayOfWeek(), RTC_IS_LEAP_YEAR() */
        CU_ASSERT_EQUAL(RTC_GetDayOfWeek(), RTC_THURSDAY);
        CU_ASSERT_EQUAL(RTC_IS_LEAP_YEAR(pRTC), 0);
        D_msg("%d/%02d/%02d %02d:%02d:%02d\n",
                sReadRTC.u32Year, sReadRTC.u32Month, sReadRTC.u32Day, sReadRTC.u32Hour, sReadRTC.u32Minute, sReadRTC.u32Second);

    /* Check RTC_SetAlarmDate(), RTC_SetAlarmTime() */
        RTC_SetAlarmDate(2014, 3, 29);
        RTC_SetAlarmTime(5, 6, 7, RTC_CLOCK_24, RTC_AM);
        RTC_GetAlarmDateAndTime(&sReadRTC);
        CU_ASSERT_EQUAL(sReadRTC.u32Year,   2014);
        CU_ASSERT_EQUAL(sReadRTC.u32Month,  3);
        CU_ASSERT_EQUAL(sReadRTC.u32Day,    29);
        CU_ASSERT_EQUAL(sReadRTC.u32Hour,   5);
        CU_ASSERT_EQUAL(sReadRTC.u32Minute, 6);
        CU_ASSERT_EQUAL(sReadRTC.u32Second, 7);
        CU_ASSERT_EQUAL(sReadRTC.u32TimeScale, RTC_CLOCK_24);
        D_msg("%d/%02d/%02d %02d:%02d:%02d\n",
                sReadRTC.u32Year, sReadRTC.u32Month, sReadRTC.u32Day, sReadRTC.u32Hour, sReadRTC.u32Minute, sReadRTC.u32Second);              

    /* Check RTC_EnableInt(), RTC_DisableInt() */
        RTC_EnableInt(RTC_INTEN_ALMIEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_ALMIEN_Msk);
        RTC_DisableInt(RTC_INTEN_ALMIEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
        RTC_EnableInt(RTC_INTEN_TICKIEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_TICKIEN_Msk);
        RTC_DisableInt(RTC_INTEN_TICKIEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
        RTC_EnableInt(RTC_INTEN_TAMP0IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_TAMP0IEN_Msk);
        RTC_DisableInt(RTC_INTEN_TAMP0IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
		RTC_EnableInt(RTC_INTEN_TAMP1IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_TAMP1IEN_Msk);
        RTC_DisableInt(RTC_INTEN_TAMP1IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
		RTC_EnableInt(RTC_INTEN_TAMP2IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_TAMP2IEN_Msk);
        RTC_DisableInt(RTC_INTEN_TAMP2IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
		RTC_EnableInt(RTC_INTEN_TAMP3IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_TAMP3IEN_Msk);
        RTC_DisableInt(RTC_INTEN_TAMP3IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
		RTC_EnableInt(RTC_INTEN_TAMP4IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_TAMP4IEN_Msk);
        RTC_DisableInt(RTC_INTEN_TAMP4IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
		RTC_EnableInt(RTC_INTEN_TAMP5IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, RTC_INTEN_TAMP5IEN_Msk);
        RTC_DisableInt(RTC_INTEN_TAMP5IEN_Msk);
        CU_ASSERT_EQUAL(pRTC->INTEN, 0);
        
    /* Check RTC_SetTime() */
        RTC_SetTime(13, 5, 6, RTC_CLOCK_24, RTC_PM);
        RTC_WaitAccessEnable();   
        RTC_GetDateAndTime(&sReadRTC);
        CU_ASSERT_EQUAL(sReadRTC.u32Hour,   13);
        CU_ASSERT_EQUAL(sReadRTC.u32Minute, 5);
        CU_ASSERT_EQUAL(sReadRTC.u32Second, 6);
        CU_ASSERT_EQUAL(sReadRTC.u32TimeScale, RTC_CLOCK_24);
    
