wosayttn/M55M1BSP/_CUnit/rtc/rtc_cunit.c
    /* Check RTC_32KCalibration() */
        RTC_WaitAccessEnable();   
        RTC_32KCalibration(327736500);
        RTC_WaitAccessEnable();
        CU_ASSERT_EQUAL(pRTC->FREQADJ, 0x152a);
        RTC_WaitAccessEnable();   
        RTC_32KCalibration(327632500);
        RTC_WaitAccessEnable();
        CU_ASSERT_EQUAL(pRTC->FREQADJ, 0x0B10);
        RTC_WaitAccessEnable();   
        RTC_32KCalibration(327680000);
        RTC_WaitAccessEnable();   
        CU_ASSERT_EQUAL(pRTC->FREQADJ, 0x1000);
        RTC_WaitAccessEnable();   

/*
TAMPER_IRQn
NVIC_EnableIRQ(TAMPER_IRQn);
*/
    /* Check RTC Interrupt behavior */
        NSC_NVIC_EnableIRQ(RTC_IRQn);
        RTC_WaitAccessEnable();   
        RTC_EnableInt(RTC_INTEN_TICKIEN_Msk);
        pRTC->TICK = RTC_TICK_1_128_SEC;
        u32Timeout = SystemCoreClock/100;
        while(gu32TickINT == 0) {
            if(u32Timeout-- == 0) {
                CU_FAIL("TICK INT FAIL");  
                RTC_Close();
                return ;
            }
        }   
        RTC_DisableInt(RTC_INTEN_TICKIEN_Msk);
        /* Disable RTC NVIC */
        NSC_NVIC_DisableIRQ(RTC_IRQn);

    /* Check RTC_SetAlarmDateMask API */
        RTC_SetAlarmDateMask(1, 1, 1, 1, 1, 1);
        CU_ASSERT_EQUAL(pRTC->CAMSK, 0x3F);
        RTC_SetAlarmDateMask(0, 1, 0, 1, 0, 1);
        CU_ASSERT_EQUAL(pRTC->CAMSK, 0x15);
        RTC_SetAlarmDateMask(1, 0, 1, 0, 1, 0);
        CU_ASSERT_EQUAL(pRTC->CAMSK, 0x2A);
        RTC_SetAlarmDateMask(0, 0, 0, 0, 0, 0);
        CU_ASSERT_EQUAL(pRTC->CAMSK, 0x0);
        
    /* Check RTC_SetAlarmTimeMask API */
        RTC_SetAlarmTimeMask(1, 1, 1, 1, 1, 1);
        CU_ASSERT_EQUAL(pRTC->TAMSK, 0x3F);
        RTC_SetAlarmTimeMask(0, 1, 0, 1, 0, 1);
        CU_ASSERT_EQUAL(pRTC->TAMSK, 0x15);
        RTC_SetAlarmTimeMask(1, 0, 1, 0, 1, 0);
        CU_ASSERT_EQUAL(pRTC->TAMSK, 0x2A);
        RTC_SetAlarmTimeMask(0, 0, 0, 0, 0, 0);
        CU_ASSERT_EQUAL(pRTC->TAMSK, 0x0);

    /* Disable RTC NVIC */
    NSC_NVIC_DisableIRQ(RTC_IRQn);
    pRTC->INTSTS |= pRTC->INTSTS;
    
    RTC_Close();
}

const uint32_t au32IOMode[] = {
    RTC_IO_MODE_INPUT,
    RTC_IO_MODE_OUTPUT,
    RTC_IO_MODE_OPEN_DRAIN,
    RTC_IO_MODE_QUASI,
};

const uint32_t au32IODigit[] = {
    RTC_IO_DIGITAL_ENABLE,
    RTC_IO_DIGITAL_DISABLE,
};

const uint32_t au32IOPullSel[] = {
    RTC_IO_PULL_UP_DOWN_DISABLE,
    RTC_IO_PULL_UP_ENABLE,
    RTC_IO_PULL_DOWN_ENABLE,
};

void API_RTC_IO_Control_Func(void) 
{
    volatile uint32_t u32Timeout;
    volatile uint32_t pin, mode, digit, pull, level, offset;
    RTC_T *pRTC;
    
//    if((__PC()&NS_OFFSET) == NS_OFFSET)
//        pRTC = RTC_NS;
//    else
        pRTC = RTC;
    
    /* Init RTC clock */
    CU_ASSERT_EQUAL(RTC_InitClock(), 0);  
    
    /* Check RTC_INIT_KEY */
    u32Timeout = SystemCoreClock/10;
    pRTC->INIT = RTC_INIT_KEY;
    while(pRTC->INIT != RTC_INIT_ACTIVE_Msk) {
        if(u32Timeout-- == 0) {
            CU_FAIL("INIT FAIL");  
            return ;
        }
    }      

    RTC->GPIOCTL0 = 0x0;
    RTC->GPIOCTL1 = 0x0;
    CU_ASSERT_EQUAL(RTC->GPIOCTL0, 0);
    CU_ASSERT_EQUAL(RTC->GPIOCTL1, 0);
    
    for(pin=4; pin<=11; pin++)
    {
        for(mode=0; mode<(sizeof(au32IOMode)/sizeof(au32IOMode[0])); mode++)
        {
            for(digit=0; digit<(sizeof(au32IODigit)/sizeof(au32IODigit[0])); digit++)
            {
                for(pull=0; pull<(sizeof(au32IOPullSel)/sizeof(au32IOPullSel[0])); pull++)
                {
                    level = 0;
                    RTC_SetGPIOMode(pin, mode, digit, pull, level);
                    if(pin <= 7) // PF.4 ~ PF.7
                    {
                        offset = (pin-4) * 8;
                        CU_ASSERT_EQUAL(pRTC->GPIOCTL0&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
                        D_msg("RTC->GPIOCTL0: 0x%x\n", pRTC->GPIOCTL0);
                    }
                    else
                    {
                        offset = (pin-8) * 8;
                        CU_ASSERT_EQUAL(pRTC->GPIOCTL1&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
                        D_msg("RTC->GPIOCTL1: 0x%x\n", pRTC->GPIOCTL0);
                    }
                    
                    level = 1;
                    RTC_SetGPIOMode(pin, mode, digit, pull, level);
                    if(pin <= 7) // PF.4 ~ PF.7
                    {
                        offset = (pin-4) * 8;
                        CU_ASSERT_EQUAL(pRTC->GPIOCTL0&(0x3F<<offset), (((mode<<0)|(1<<2)|(digit<<3)|(pull<<4)) << offset));
                    }
                    else
                    {
                        offset = (pin-8) * 8;
                        CU_ASSERT_EQUAL(pRTC->GPIOCTL1&(0x3F<<offset), (((mode<<0)|(1<<2)|(digit<<3)|(pull<<4)) << offset));
                    }
                    
                    level = 0;
                    RTC_SetGPIOMode(pin, mode, digit, pull, level);
                    if(pin <= 7) // PF.4 ~ PF.7
                    {
                        offset = (pin-4) * 8;
                        CU_ASSERT_EQUAL(pRTC->GPIOCTL0&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
                    }
                    else
                    {
                        offset = (pin-8) * 8;
                        CU_ASSERT_EQUAL(pRTC->GPIOCTL1&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
                    }
                }
            }
        }
        
        mode = digit = pull = level = 0;
        RTC_SetGPIOMode(pin, mode, digit, pull, level);
        RTC_SetGPIOLevel(pin, 0);
        if(pin <= 7) // PF.4 ~ PF.7
        {
            offset = (pin-4) * 8;
            CU_ASSERT_EQUAL(pRTC->GPIOCTL0&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
        }
        else
        {
            offset = (pin-8) * 8;
            CU_ASSERT_EQUAL(pRTC->GPIOCTL1&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
        }
        mode = digit = pull = 1; level = 0;
        RTC_SetGPIOMode(pin, mode, digit, pull, level);
        RTC_SetGPIOLevel(pin, 1);
        if(pin <= 7) // PF.4 ~ PF.7
        {
            offset = (pin-4) * 8;
            CU_ASSERT_EQUAL(pRTC->GPIOCTL0&(0x3F<<offset), (((mode<<0)|(1<<2)|(digit<<3)|(pull<<4)) << offset));
        }
        else
        {
            offset = (pin-8) * 8;
            CU_ASSERT_EQUAL(pRTC->GPIOCTL1&(0x3F<<offset), (((mode<<0)|(1<<2)|(digit<<3)|(pull<<4)) << offset));
        }
        mode = digit = pull = 0; level = 0;
        RTC_SetGPIOMode(pin, mode, digit, pull, level);
        RTC_SetGPIOLevel(pin, 0);
        if(pin <= 7) // PF.4 ~ PF.7
        {
            offset = (pin-4) * 8;
            CU_ASSERT_EQUAL(pRTC->GPIOCTL0&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
        }
        else
        {
            offset = (pin-8) * 8;
            CU_ASSERT_EQUAL(pRTC->GPIOCTL1&(0x3F<<offset), (((mode<<0)|(0<<2)|(digit<<3)|(pull<<4)) << offset));
        }
    }
    
    /* Check RTC_SET_IOCTL_BY_GPIO, RTC_SET_IOCTL_BY_RTC, RTC_GET_IOCTL_PROPERTY */
    RTC_SET_IOCTL_BY_GPIO(pRTC);
        CU_ASSERT_EQUAL(RTC_GET_IOCTL_PROPERTY(pRTC), 0);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&BIT8, 0);
    RTC_SET_IOCTL_BY_RTC(pRTC);
        CU_ASSERT_EQUAL(RTC_GET_IOCTL_PROPERTY(pRTC), 1);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&BIT8, BIT8);
    RTC_SET_IOCTL_BY_GPIO(pRTC);
        CU_ASSERT_EQUAL(RTC_GET_IOCTL_PROPERTY(pRTC), 0);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&BIT8, 0);
    
    RTC_Close();
}

void API_RTC_ClockSource_Func(void) 
{
    volatile uint32_t u32Timeout;
    RTC_T *pRTC;
    
//    if((__PC()&NS_OFFSET) == NS_OFFSET)
//        pRTC = RTC_NS;
//    else
        pRTC = RTC;
    
    
    /* Init RTC clock */
    CU_ASSERT_EQUAL(RTC_InitClock(), 0);  
    
    /* Check RTC_INIT_KEY */
    u32Timeout = SystemCoreClock/10;
    pRTC->INIT = RTC_INIT_KEY;
    while(pRTC->INIT != RTC_INIT_ACTIVE_Msk) {
        if(u32Timeout-- == 0) {
            CU_FAIL("INIT FAIL");  
            return ;
        }
    }      

    RTC_SetClockSource(RTC_CLOCK_SOURCE_LXT);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&(BIT7|BIT6), 0);
    RTC_SetClockSource(RTC_CLOCK_SOURCE_LIRC);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&BIT7, BIT7);
    RTC_SetClockSource(RTC_CLOCK_SOURCE_LIRC32K);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&(BIT7|BIT6|BIT0), (BIT6|BIT0));
    RTC_SetClockSource(RTC_CLOCK_SOURCE_LXT);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&(BIT7|BIT6), 0);
    RTC_SetClockSource(RTC_CLOCK_SOURCE_LIRC);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&BIT7, BIT7);
    RTC_SetClockSource(RTC_CLOCK_SOURCE_LIRC32K);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&(BIT7|BIT6|BIT0), (BIT6|BIT0));
    RTC_SetClockSource(RTC_CLOCK_SOURCE_LXT);
        CU_ASSERT_EQUAL(pRTC->LXTCTL&(BIT7|BIT6), 0);
    
    RTC_Close();
}

CU_TestInfo RTC_CONSTANT_MACRO[] =
{
    {"Check RTC CONSTANT ", CONSTANT_RTC}, 
    {"Check RTC MACRO ",    MACRO_RTC}, 
    CU_TEST_INFO_NULL
};

CU_TestInfo RTC_API[] =
{
    {"Check RTC Data, Time APIs ",      API_RTC_DataTime_Func}, 
    {"Check RTC IO Control APIs ",      API_RTC_IO_Control_Func}, 
    {"Check RTC Clock Source API ",     API_RTC_ClockSource_Func}, 
    CU_TEST_INFO_NULL
};
